app/views/orders/index.html.erb

                                      <td><%= order.temporal_lapse %></td>
                                      <td><%= order.order_record %></td>
---
SELECT "orders".* FROM "orders"