app/controllers/orders_controller.rb

INSERT INTO "orders" ("status", "number", "os_date", "hour", "medium", "called", "operator", "sector", "responsible", "contact", "unity", "scope", "address", "route", "vehicle", "ranking", "modality", "cause", "description", "authorization", "priority", "link", "operational", "measure", "request_date", "insertion_routing", "reporting_routing", "deliberation", "temporal_lapse", "order_record", "feedback", "execution_availability", "devolution", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35) RETURNING "id"
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save